app/views/application/_slide.html.erb

<% slidesclases[rand_slides] %>
<% @sliders = Slider.all %>
---
SELECT `sliders`.* FROM `sliders`

          <li>
            <% @empresas = Empresa.find(:all, :conditions => {:id =>" #{slider.id_empresa}"}) %>
---
SELECT `empresas`.* FROM `empresas` WHERE `empresas`.`id` = 1